import React, { useState } from 'react';

import styles from './Login.scss';
import 'bootstrap/dist/css/bootstrap.min.css';
import { Link, useNavigate, Navigate, } from 'react-router-dom';
import { useDispatch, useSelector } from 'react-redux';
import TextField from "@mui/material/TextField";
import IconButton from '@mui/material/IconButton';
import OutlinedInput from '@mui/material/OutlinedInput';
import InputAdornment from '@mui/material/InputAdornment';
import Visibility from '@mui/icons-material/Visibility';
import VisibilityOff from '@mui/icons-material/VisibilityOff';
import {
    Container,
    Row,
    Navbar,
    Nav,
    Button,
    ButtonGroup,
    Offcanvas,
    Image,
    Col,
    NavDropdown,
} from 'react-bootstrap';
import { useForm } from 'react-hook-form';
import { fetchAuth, selectIsAuth } from "../../redux/slices/auth";

export const Login = () => {

    const [showPassword, setShowPassword] = useState(false);

    const handleClickShowPassword = () => {
        setShowPassword((show) => !show);
    };

    const handleMouseDownPassword = (event) => {
        event.preventDefault();
    };

    const navigate = useNavigate();

    const handleGoBack = () => {
        navigate(-1); // Переход на предыдущую страницу
    };
    const isAuth = useSelector(selectIsAuth);
    const dispatch = useDispatch();

    const {
        register,
        handleSubmit,
        setError,
        formState: { errors, isValid }
    } = useForm({
        defaultValues: {
            email: '',
            password: '',
        },
        mode: 'onSubmit',
    })

    const onSubmit = async (values) => {
        const data = await dispatch(fetchAuth(values));

        if (!data.payload) {
            return alert('Could not log in');
        }

        if ('token' in data.payload) {
            window.localStorage.setItem('token', data.payload.token);
        }
    }

    if (isAuth) {
        return <Navigate to="/" />
    }



    return (
        <>
            <div className="login">
                <header className='container-fluid'>
                    <Container className={styles.container}>
                        <Row className='row justify-content-between'>
                            <div className="back-icon" onClick={handleGoBack}>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M9.70711 5.29289C10.0976 5.68342 10.0976 6.31658 9.70711 6.70711L5.41421 11H21C21.5523 11 22 11.4477 22 12C22 12.5523 21.5523 13 21 13H5.41421L9.70711 17.2929C10.0976 17.6834 10.0976 18.3166 9.70711 18.7071C9.31658 19.0976 8.68342 19.0976 8.29289 18.7071L2.29289 12.7071C1.90237 12.3166 1.90237 11.6834 2.29289 11.2929L8.29289 5.29289C8.68342 4.90237 9.31658 4.90237 9.70711 5.29289Z" fill="#FCFCFC" />
                                </svg>
                            </div>
                            <div className="logo">
                                <Link to="/">
                                    <svg width="108" height="26" viewBox="0 0 108 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M12.4515 13.5757V12.4243H13.6054V13.5757H12.4515ZM13.5333 11.273V9.83377H16.2016V12.4963H14.7593V11.273H13.5333ZM9.85526 12.4963V9.83377H12.5236V11.273H11.2976V12.4963H9.85526ZM13.5333 16.1663V14.7271H14.7593V13.5037H16.2016V16.1663H13.5333ZM9.85526 16.1663V13.5037H11.2976V14.7271H12.5236V16.1663H9.85526Z" fill="#28D377" />
                                        <path d="M12.8956 19.0295L14.147 23.6898L5.50648 26L3.19126 17.3783L7.86182 16.1296L8.92557 20.0909L12.8956 19.0295ZM23.7417 11.8839L26.057 20.5056L17.4164 22.8157L16.1649 18.1554L20.1349 17.0939L19.0712 13.1326L23.7417 11.8839ZM8.64054 3.18428L9.89202 7.84463L5.92204 8.90606L6.98579 12.8674L2.31523 14.1161L0 5.49445L8.64054 3.18428ZM20.5505 0L22.8657 8.62165L18.1951 9.87039L17.1314 5.90909L13.1614 6.97052L11.9099 2.31016L20.5505 0Z" fill="#28D377" />
                                        <path d="M40.3235 13.5074V11.2383H44.0757V17.9132C42.2691 18.2032 40.8036 18.3481 39.6792 18.3481C37.6705 18.3481 36.2871 17.8124 35.5291 16.7408C34.7837 15.6693 34.411 13.9675 34.411 11.6354C34.411 9.30327 34.8026 7.62036 35.5859 6.58667C36.3692 5.55297 37.7021 5.03612 39.5845 5.03612C40.7594 5.03612 42.0291 5.16848 43.3935 5.43321L44.0757 5.56558L43.9999 7.58885C42.4839 7.42497 41.2395 7.34303 40.2667 7.34303C39.3065 7.34303 38.6306 7.45648 38.239 7.68339C37.8473 7.9103 37.5568 8.33261 37.3673 8.9503C37.1904 9.55539 37.102 10.6017 37.102 12.0892C37.102 13.5641 37.2851 14.5978 37.6515 15.1903C38.0179 15.7828 38.7759 16.079 39.9256 16.079L41.4985 16.0034V13.5074H40.3235Z" fill="#FCFCFC" />
                                        <path d="M46.4887 14.2448V11.9379H52.098V14.2448H46.4887Z" fill="#FCFCFC" />
                                        <path d="M58.4773 7.30521C57.1002 7.30521 56.4116 7.75903 56.4116 8.66667C56.4116 9.07006 56.5822 9.37891 56.9233 9.59321C57.2644 9.80751 58.0603 10.1164 59.3111 10.5198C60.5744 10.9232 61.4588 11.3833 61.9642 11.9001C62.4695 12.4044 62.7222 13.1859 62.7222 14.2448C62.7222 15.5937 62.3116 16.6148 61.4904 17.3081C60.6692 18.0015 59.5953 18.3481 58.2688 18.3481C57.2834 18.3481 56.0769 18.1968 54.6493 17.8943L53.967 17.7619L54.2323 15.7387C55.9253 15.9656 57.2202 16.079 58.1172 16.079C59.4564 16.079 60.1259 15.5244 60.1259 14.415C60.1259 14.0116 59.968 13.6965 59.6522 13.4696C59.349 13.2427 58.7362 12.9968 57.814 12.7321C56.3485 12.3161 55.3125 11.8245 54.7061 11.2572C54.1123 10.6773 53.8154 9.87685 53.8154 8.85576C53.8154 7.56994 54.2071 6.61188 54.9904 5.98158C55.7736 5.35127 56.8475 5.03612 58.2119 5.03612C59.1468 5.03612 60.3344 5.16218 61.7746 5.4143L62.4569 5.54667L62.2484 7.60776C60.4671 7.40606 59.21 7.30521 58.4773 7.30521Z" fill="#FCFCFC" />
                                        <path d="M73.2766 17.9132C71.9374 18.2032 70.7309 18.3481 69.657 18.3481C68.5832 18.3481 67.7241 18.2158 67.0798 17.951C66.4354 17.6863 65.9301 17.264 65.5637 16.6841C65.1973 16.1042 64.9447 15.4235 64.8057 14.6419C64.6667 13.8604 64.5972 12.8771 64.5972 11.6921C64.5972 9.20873 64.9447 7.4817 65.6395 6.51103C66.347 5.52776 67.642 5.03612 69.5244 5.03612C70.6109 5.03612 71.8679 5.2063 73.2955 5.54667L73.2197 7.62667C71.969 7.43758 70.9267 7.34303 70.0929 7.34303C69.2717 7.34303 68.6842 7.45648 68.3305 7.68339C67.9767 7.8977 67.7114 8.3137 67.5346 8.93139C67.3703 9.54909 67.2882 10.6017 67.2882 12.0892C67.2882 13.5767 67.4588 14.6104 67.7999 15.1903C68.1536 15.7576 68.8485 16.0412 69.8844 16.0412C70.933 16.0412 72.0448 15.953 73.2197 15.7765L73.2766 17.9132Z" fill="#FCFCFC" />
                                        <path d="M78.2437 15.0958C78.6227 15.7513 79.3239 16.079 80.3472 16.079C81.3705 16.079 82.0654 15.7513 82.4317 15.0958C82.8108 14.4276 83.0003 13.3183 83.0003 11.7678C83.0003 10.2046 82.8108 9.07006 82.4317 8.36412C82.0527 7.65818 81.3579 7.30521 80.3472 7.30521C79.3365 7.30521 78.6416 7.65818 78.2626 8.36412C77.8836 9.07006 77.6941 10.2046 77.6941 11.7678C77.6941 13.3183 77.8773 14.4276 78.2437 15.0958ZM84.4784 16.7598C83.6825 17.8187 82.3054 18.3481 80.3472 18.3481C78.389 18.3481 77.0056 17.8187 76.197 16.7598C75.4011 15.6882 75.0031 14.0179 75.0031 11.7488C75.0031 9.47976 75.4011 7.79685 76.197 6.70012C77.0056 5.59079 78.389 5.03612 80.3472 5.03612C82.3054 5.03612 83.6825 5.59079 84.4784 6.70012C85.287 7.79685 85.6912 9.47976 85.6912 11.7488C85.6912 14.0179 85.287 15.6882 84.4784 16.7598Z" fill="#FCFCFC" />
                                        <path d="M92.9558 14.3772H90.8333V18.1212H88.2182V5.26303H92.9558C96.0132 5.26303 97.5418 6.75055 97.5418 9.72558C97.5418 11.2257 97.1502 12.3792 96.3669 13.1859C95.5962 13.9801 94.4592 14.3772 92.9558 14.3772ZM90.8333 12.1459H92.9369C94.2381 12.1459 94.8888 11.3392 94.8888 9.72558C94.8888 8.93139 94.7308 8.36412 94.415 8.02376C94.0992 7.67079 93.6064 7.4943 92.9369 7.4943H90.8333V12.1459Z" fill="#FCFCFC" />
                                        <path d="M99.6618 18.1212V5.26303H108V7.53212H102.277V10.5387H106.863V12.7699H102.277V15.8521H108V18.1212H99.6618Z" fill="#FCFCFC" />
                                    </svg>
                                </Link>
                            </div>
                            <div className="clear">

                            </div>
                        </Row>
                    </Container>
                </header>
                <Container>
                    <div className="main row col-11 col-md-8 col-xl-6 justify-content-center">
                        <div className="register-form col-xl-11">
                            <label>Welcome back</label>
                            <form onSubmit={handleSubmit(onSubmit)}>
                                <div className="inputs">
                                    <div className="textfield email">
                                        <label htmlFor="">Email</label>
                                        <div className="input email">
                                            <div className="svg">
                                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <g mask="url(#mask0_667_2554)">
                                                        <path fill-rule="evenodd" clip-rule="evenodd" d="M8.17318 2.76121C10.207 1.91879 12.4619 1.771 14.5882 2.34075C16.7145 2.91049 18.5935 4.16595 19.9335 5.91239C21.2736 7.65883 22 9.79866 22 12V13.5C22 15.433 20.433 17 18.5 17C17.2958 17 16.2336 16.3918 15.6039 15.4659C14.6942 16.4116 13.4158 17 12 17C9.23859 17 7.00001 14.7614 7.00001 12C7.00001 9.23858 9.23859 7 12 7C13.1256 7 14.1644 7.37195 15 7.99964C15.0002 7.44752 15.4478 7 16 7C16.5523 7 17 7.44772 17 8V13.5C17 14.3284 17.6716 15 18.5 15C19.3284 15 20 14.3284 20 13.5V12C20 10.2389 19.4189 8.52707 18.3468 7.12991C17.2748 5.73276 15.7716 4.7284 14.0706 4.2726C12.3695 3.8168 10.5656 3.93503 8.93855 4.60897C7.31153 5.2829 5.95235 6.47487 5.07181 8C4.19127 9.52514 3.83859 11.2982 4.06846 13.0442C4.29832 14.7902 5.09789 16.4116 6.34316 17.6569C7.58843 18.9021 9.2098 19.7017 10.9558 19.9316C12.7018 20.1614 14.4749 19.8087 16 18.9282C16.4783 18.6521 17.0899 18.8159 17.366 19.2942C17.6422 19.7725 17.4783 20.3841 17 20.6603C15.0936 21.7609 12.8773 22.2018 10.6948 21.9145C8.51224 21.6271 6.48553 20.6277 4.92895 19.0711C3.37236 17.5145 2.3729 15.4878 2.08557 13.3053C1.79823 11.1228 2.23909 8.90642 3.33976 7C4.44043 5.09359 6.13941 3.60363 8.17318 2.76121ZM15 12C15 10.3431 13.6569 9 12 9C10.3432 9 9.00001 10.3431 9.00001 12C9.00001 13.6569 10.3432 15 12 15C13.6569 15 15 13.6569 15 12Z" fill="#FCFCFC" />
                                                    </g>
                                                </svg>
                                            </div>
                                            {/* <input type="text"
                                                error={Boolean(errors.email?.message)}
                                                helperText={errors.email?.message}
                                                {...register('email', { required: 'Укажите почту' })} /> */}
                                            <TextField
                                                error={Boolean(errors.email?.message)}
                                                helperText={errors.email?.message}
                                                {...register('email', { required: 'Укажите почту' })}
                                                fullWidth
                                            />
                                        </div>
                                    </div>

                                    <div className="textfield password">
                                        <label htmlFor="">Password</label>
                                        <div className="input password">
                                            <div className="svg">
                                                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                    <path d="M5.83301 11.6667C5.37467 11.6667 4.98231 11.5035 4.65592 11.1771C4.32954 10.8507 4.16634 10.4583 4.16634 10C4.16634 9.54167 4.32954 9.14931 4.65592 8.82292C4.98231 8.49653 5.37467 8.33333 5.83301 8.33333C6.29134 8.33333 6.6837 8.49653 7.01009 8.82292C7.33648 9.14931 7.49967 9.54167 7.49967 10C7.49967 10.4583 7.33648 10.8507 7.01009 11.1771C6.6837 11.5035 6.29134 11.6667 5.83301 11.6667ZM5.83301 15C4.44412 15 3.26356 14.5139 2.29134 13.5417C1.31912 12.5694 0.833008 11.3889 0.833008 10C0.833008 8.61111 1.31912 7.43056 2.29134 6.45833C3.26356 5.48611 4.44412 5 5.83301 5C6.76356 5 7.60731 5.22917 8.36426 5.6875C9.1212 6.14583 9.7219 6.75 10.1663 7.5H17.4997L19.9997 10L16.2497 13.75L14.583 12.5L12.9163 13.75L11.1455 12.5H10.1663C9.7219 13.25 9.1212 13.8542 8.36426 14.3125C7.60731 14.7708 6.76356 15 5.83301 15ZM5.83301 13.3333C6.61079 13.3333 7.29481 13.0972 7.88509 12.625C8.47537 12.1528 8.86773 11.5556 9.06217 10.8333H11.6663L12.8747 11.6875L14.583 10.4167L16.0622 11.5625L17.6247 10L16.7913 9.16667H9.06217C8.86773 8.44444 8.47537 7.84722 7.88509 7.375C7.29481 6.90278 6.61079 6.66667 5.83301 6.66667C4.91634 6.66667 4.13162 6.99306 3.47884 7.64583C2.82606 8.29861 2.49967 9.08333 2.49967 10C2.49967 10.9167 2.82606 11.7014 3.47884 12.3542C4.13162 13.0069 4.91634 13.3333 5.83301 13.3333Z" fill="#FCFCFC" />
                                                </svg>
                                            </div>
                                            {/* <input type="text"
                                                error={Boolean(errors.password?.message)}
                                                helperText={errors.password?.message}
                                                {...register('password', { required: 'Укажите пароль' })} /> */}
                                            <OutlinedInput
                                                id="outlined-adornment-password"
                                                type={showPassword ? 'text' : 'password'}
                                                error={Boolean(errors.password?.message)}
                                                helperText={errors.password?.message}
                                                {...register('password', { required: 'Укажите пароль' })}
                                                fullWidth
                                                endAdornment={
                                                    <InputAdornment position="end">
                                                        <IconButton
                                                            // aria-label="toggle password visibility"
                                                            onClick={handleClickShowPassword}
                                                            onMouseDown={handleMouseDownPassword}
                                                            edge="end"
                                                        >
                                                            {showPassword ? <VisibilityOff /> : <Visibility />}
                                                        </IconButton>
                                                    </InputAdornment>
                                                }
                                            />
                                        </div>
                                    </div>
                                </div>
                                <div className="actions">
                                    <div className="buttons">
                                        <Button type='submit' className='create-btn'>Log me in</Button>
                                        <div className="line"></div>
                                        <Button className='google-btn'>
                                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <g clip-path="url(#clip0_1778_5873)">
                                                    <path d="M24.0002 12.2659C24.0002 11.282 23.9185 10.5641 23.7417 9.81958H12.2451V14.2601H18.9934C18.8574 15.3637 18.1227 17.0256 16.49 18.1423L16.4671 18.291L20.1021 21.0428L20.354 21.0674C22.6668 18.98 24.0002 15.9088 24.0002 12.2659Z" fill="#4285F4" />
                                                    <path d="M12.2445 23.9657C15.5505 23.9657 18.326 22.9021 20.3533 21.0674L16.4893 18.1424C15.4553 18.847 14.0676 19.3389 12.2445 19.3389C9.0064 19.3389 6.25812 17.2516 5.27843 14.3666L5.13483 14.3785L1.35509 17.237L1.30566 17.3712C3.31925 21.28 7.45531 23.9657 12.2445 23.9657Z" fill="#34A853" />
                                                    <path d="M5.27886 14.3665C5.02036 13.622 4.87076 12.8242 4.87076 12C4.87076 11.1756 5.02036 10.3779 5.26526 9.6334L5.25841 9.47484L1.43131 6.57043L1.30609 6.62864C0.476196 8.25068 0 10.0722 0 12C0 13.9278 0.476196 15.7492 1.30609 17.3712L5.27886 14.3665Z" fill="#FBBC05" />
                                                    <path d="M12.2445 4.66101C14.5438 4.66101 16.0947 5.63156 16.9791 6.44263L20.4349 3.14539C18.3125 1.21758 15.5505 0.0343018 12.2445 0.0343018C7.45531 0.0343018 3.31925 2.71992 1.30566 6.62869L5.26483 9.63345C6.25812 6.74839 9.0064 4.66101 12.2445 4.66101Z" fill="#EB4335" />
                                                </g>
                                                <defs>
                                                    <clipPath id="clip0_1778_5873">
                                                        <rect width="24" height="24" fill="white" />
                                                    </clipPath>
                                                </defs>
                                            </svg>
                                            Log in with Google</Button>
                                    </div>
                                </div>
                            </form>

                            <div className="form-footer d-flex">
                                <label>New to G-SCOPE?</label>
                                <Link to="/register">Sign up</Link>
                            </div>
                        </div>
                    </div>
                </Container>
            </div>
            <footer></footer>

        </>
    );
}